 #define _CRT_SECURE_NO_WARNINGS  1
#include<stdio.h>

//int main()
//{
//	unsigned int a = -10;
//	//1000 0000 0000 0000 0000 0000 0000 1010 - 原码 
//	//1111 1111 1111 1111 1111 1111 1111 0101 - 反码
//	//1111 1111 1111 1111 1111 1111 1111 0110 - 补码
//
//
//	return 0;
//}
//数据也要按照字节为单位划分成若干块
//数据按照字节为单位，也是有高权值，低权值为之别的。
// 
//大小端：
//如何理解大小端
//大小端基本的概念
//小端：按照字节为单位，低权值位数据存储在低地址处，就叫做小端
//大段：按照字节为单位，低权值位数据存储在高地址处，就叫做大端  
//大小端是如何影响数据存储的
//大小端存储方案，本质数据和空间按照字节为单位的一种映射关系

//int main()
//{
//	char c = -128;
//	printf("%d\n", c);
//	return 0;
//}

//char [-128,127] [-2^7,2^7-1]
int main()
{
	char a[1000];
	for (int i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d\n", strlen(a));

	return 0;
}